Revit 2027 API
DetailCurveArrayIterator Constructor
For Internal Use Only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DetailCurveArrayIterator()
Public Sub New
public:
DetailCurveArrayIterator()
new : unit -> DetailCurveArrayIterator
Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
See Also
Reference
DetailCurveArrayIterator Class
Autodesk.Revit.DB Namespace